Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_can.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32L4R5_can.
; ==============

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32L4R5_can equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

#include	<stdint.h>

// CAN address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	MCR;
	volatile	uint32_t	MSR;
	volatile	uint32_t	TSR;
	volatile	uint32_t	RF0R;
	volatile	uint32_t	RF1R;
	volatile	uint32_t	IER;
	volatile	uint32_t	ESR;
	volatile	uint32_t	BTR;
	volatile	uint32_t	RESERVED0[88];
	volatile	uint32_t	TI0R;
	volatile	uint32_t	TDT0R;
	volatile	uint32_t	TDL0R;
	volatile	uint32_t	TDH0R;
	volatile	uint32_t	TI1R;
	volatile	uint32_t	TDT1R;
	volatile	uint32_t	TDL1R;
	volatile	uint32_t	TDH1R;
	volatile	uint32_t	TI2R;
	volatile	uint32_t	TDT2R;
	volatile	uint32_t	TDL2R;
	volatile	uint32_t	TDH2R;
	volatile	uint32_t	RI0R;
	volatile	uint32_t	RDT0R;
	volatile	uint32_t	RDL0R;
	volatile	uint32_t	RDH0R;
	volatile	uint32_t	RI1R;
	volatile	uint32_t	RDT1R;
	volatile	uint32_t	RDL1R;
	volatile	uint32_t	RDH1R;
	volatile	uint32_t	RESERVED1[12];
	volatile	uint32_t	FMR;
	volatile	uint32_t	FM1R;
	volatile	uint32_t	RESERVED2;
	volatile	uint32_t	FS1R;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	FFA1R;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	FA1R;
	volatile	uint32_t	RESERVED5[8];
	volatile	uint32_t	F0R1;
	volatile	uint32_t	F0R2;
	volatile	uint32_t	F1R1;
	volatile	uint32_t	F1R2;
	volatile	uint32_t	F2R1;
	volatile	uint32_t	F2R2;
	volatile	uint32_t	F3R1;
	volatile	uint32_t	F3R2;
	volatile	uint32_t	F4R1;
	volatile	uint32_t	F4R2;
	volatile	uint32_t	F5R1;
	volatile	uint32_t	F5R2;
	volatile	uint32_t	F6R1;
	volatile	uint32_t	F6R2;
	volatile	uint32_t	F7R1;
	volatile	uint32_t	F7R2;
	volatile	uint32_t	F8R1;
	volatile	uint32_t	F8R2;
	volatile	uint32_t	F9R1;
	volatile	uint32_t	F9R2;
	volatile	uint32_t	F10R1;
	volatile	uint32_t	F10R2;
	volatile	uint32_t	F11R1;
	volatile	uint32_t	F11R2;
	volatile	uint32_t	F12R1;
	volatile	uint32_t	F12R2;
	volatile	uint32_t	F13R1;
	volatile	uint32_t	F13R2;
	volatile	uint32_t	F14R1;
	volatile	uint32_t	F14R2;
	volatile	uint32_t	F15R1;
	volatile	uint32_t	F15R2;
	volatile	uint32_t	F16R1;
	volatile	uint32_t	F16R2;
	volatile	uint32_t	F17R1;
	volatile	uint32_t	F17R2;
	volatile	uint32_t	F18R1;
	volatile	uint32_t	F18R2;
	volatile	uint32_t	F19R1;
	volatile	uint32_t	F19R2;
	volatile	uint32_t	F20R1;
	volatile	uint32_t	F20R2;
	volatile	uint32_t	F21R1;
	volatile	uint32_t	F21R2;
	volatile	uint32_t	F22R1;
	volatile	uint32_t	F22R2;
	volatile	uint32_t	F23R1;
	volatile	uint32_t	F23R2;
	volatile	uint32_t	F24R1;
	volatile	uint32_t	F24R2;
	volatile	uint32_t	F25R1;
	volatile	uint32_t	F25R2;
	volatile	uint32_t	F26R1;
	volatile	uint32_t	F26R2;
	volatile	uint32_t	F27R1;
	volatile	uint32_t	F27R2;
} CAN_TypeDef;

#ifdef __cplusplus
#define	CAN1	reinterpret_cast<CAN_TypeDef *>(0x40006400u)

#else
#define	CAN1	((CAN_TypeDef *)0x40006400u)
#endif

// MCR Configuration

#define	CAN_MCR_INRQ		(0x1u<<0)
#define	CAN_MCR_SLEEP		(0x1u<<1)
#define	CAN_MCR_TXFP		(0x1u<<2)
#define	CAN_MCR_RFLM		(0x1u<<3)
#define	CAN_MCR_NART		(0x1u<<4)
#define	CAN_MCR_AWUM		(0x1u<<5)
#define	CAN_MCR_ABOM		(0x1u<<6)
#define	CAN_MCR_TTCM		(0x1u<<7)
#define	CAN_MCR_RESET		(0x1u<<15)
#define	CAN_MCR_DBF			(0x1u<<16)

// MSR Configuration

#define	CAN_MSR_INAK		(0x1u<<0)
#define	CAN_MSR_SLAK		(0x1u<<1)
#define	CAN_MSR_ERRI		(0x1u<<2)
#define	CAN_MSR_WKUI		(0x1u<<3)
#define	CAN_MSR_SLAKI		(0x1u<<4)
#define	CAN_MSR_TXM			(0x1u<<8)
#define	CAN_MSR_RXM			(0x1u<<9)
#define	CAN_MSR_SAMP		(0x1u<<10)
#define	CAN_MSR_RX			(0x1u<<11)

// TSR Configuration

#define	CAN_TSR_RQCP0		(0x1u<<0)
#define	CAN_TSR_TXOK0		(0x1u<<1)
#define	CAN_TSR_ALST0		(0x1u<<2)
#define	CAN_TSR_TERR0		(0x1u<<3)
#define	CAN_TSR_ABRQ0		(0x1u<<7)
#define	CAN_TSR_RQCP1		(0x1u<<8)
#define	CAN_TSR_TXOK1		(0x1u<<9)
#define	CAN_TSR_ALST1		(0x1u<<10)
#define	CAN_TSR_TERR1		(0x1u<<11)
#define	CAN_TSR_ABRQ1		(0x1u<<15)
#define	CAN_TSR_RQCP2		(0x1u<<16)
#define	CAN_TSR_TXOK2		(0x1u<<17)
#define	CAN_TSR_ALST2		(0x1u<<18)
#define	CAN_TSR_TERR2		(0x1u<<19)
#define	CAN_TSR_ABRQ2		(0x1u<<23)
#define	CAN_TSR_CODE		(0x3u<<24)
#define	CAN_TSR_CODE_0		(0x1u<<24)
#define	CAN_TSR_TME0		(0x1u<<26)
#define	CAN_TSR_TME1		(0x1u<<27)
#define	CAN_TSR_TME2		(0x1u<<28)
#define	CAN_TSR_LOW0		(0x1u<<29)
#define	CAN_TSR_LOW1		(0x1u<<30)
#define	CAN_TSR_LOW2		(0x1u<<31)

