Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_can.h
// RF0R Configuration

#define	CAN_RF0R_FMP0		(0x3u<<0)
#define	CAN_RF0R_FMP0_0		(0x1u<<0)
#define	CAN_RF0R_FULL0		(0x1u<<3)
#define	CAN_RF0R_FOVR0		(0x1u<<4)
#define	CAN_RF0R_RFOM0		(0x1u<<5)

// RF1R Configuration

#define	CAN_RF1R_FMP1		(0x3u<<0)
#define	CAN_RF1R_FMP1_0		(0x1u<<0)
#define	CAN_RF1R_FULL1		(0x1u<<3)
#define	CAN_RF1R_FOVR1		(0x1u<<4)
#define	CAN_RF1R_RFOM1		(0x1u<<5)

// IER Configuration

#define	CAN_IER_TMEIE		(0x1u<<0)
#define	CAN_IER_FMPIE0		(0x1u<<1)
#define	CAN_IER_FFIE0		(0x1u<<2)
#define	CAN_IER_FOVIE0		(0x1u<<3)
#define	CAN_IER_FMPIE1		(0x1u<<4)
#define	CAN_IER_FFIE1		(0x1u<<5)
#define	CAN_IER_FOVIE1		(0x1u<<6)
#define	CAN_IER_EWGIE		(0x1u<<8)
#define	CAN_IER_EPVIE		(0x1u<<9)
#define	CAN_IER_BOFIE		(0x1u<<10)
#define	CAN_IER_LECIE		(0x1u<<11)
#define	CAN_IER_ERRIE		(0x1u<<15)
#define	CAN_IER_WKUIE		(0x1u<<16)
#define	CAN_IER_SLKIE		(0x1u<<17)

// ESR Configuration

#define	CAN_ESR_EWGF		(0x1u<<0)
#define	CAN_ESR_EPVF		(0x1u<<1)
#define	CAN_ESR_BOFF		(0x1u<<2)
#define	CAN_ESR_LEC			(0x7u<<4)
#define	CAN_ESR_LEC_0		(0x1u<<4)
#define	CAN_ESR_TEC			(0xFFu<<16)
#define	CAN_ESR_TEC_0		(0x1u<<16)
#define	CAN_ESR_REC			(0xFFu<<24)
#define	CAN_ESR_REC_0		(0x1u<<24)

// BTR Configuration

#define	CAN_BTR_BRP			(0x3FFu<<0)
#define	CAN_BTR_BRP_0		(0x1u<<0)
#define	CAN_BTR_TS1			(0xFu<<16)
#define	CAN_BTR_TS1_0		(0x1u<<16)
#define	CAN_BTR_TS2			(0x7u<<20)
#define	CAN_BTR_TS2_0		(0x1u<<20)
#define	CAN_BTR_SJW			(0x3u<<24)
#define	CAN_BTR_SJW_0		(0x1u<<24)
#define	CAN_BTR_LBKM		(0x1u<<30)
#define	CAN_BTR_SILM		(0x1u<<31)

// TI0R Configuration

#define	CAN_TI0R_TXRQ		(0x1u<<0)
#define	CAN_TI0R_RTR		(0x1u<<1)
#define	CAN_TI0R_IDE		(0x1u<<2)
#define	CAN_TI0R_EXID		(0x3FFFFu<<3)
#define	CAN_TI0R_EXID_0		(0x1u<<3)
#define	CAN_TI0R_STID		(0x7FFu<<21)
#define	CAN_TI0R_STID_0		(0x1u<<21)

// TDT0R Configuration

#define	CAN_TDT0R_DLC		(0xFu<<0)
#define	CAN_TDT0R_DLC_0		(0x1u<<0)
#define	CAN_TDT0R_TGT		(0x1u<<8)
#define	CAN_TDT0R_TIME		(0xFFFFu<<16)
#define	CAN_TDT0R_TIME_0	(0x1u<<16)

// TDL0R Configuration

#define	CAN_TDL0R_DATA0		(0xFFu<<0)
#define	CAN_TDL0R_DATA0_0	(0x1u<<0)
#define	CAN_TDL0R_DATA1		(0xFFu<<8)
#define	CAN_TDL0R_DATA1_0	(0x1u<<8)
#define	CAN_TDL0R_DATA2		(0xFFu<<16)
#define	CAN_TDL0R_DATA2_0	(0x1u<<16)
#define	CAN_TDL0R_DATA3		(0xFFu<<24)
#define	CAN_TDL0R_DATA3_0	(0x1u<<24)

// TDH0R Configuration

#define	CAN_TDH0R_DATA4		(0xFFu<<0)
#define	CAN_TDH0R_DATA4_0	(0x1u<<0)
#define	CAN_TDH0R_DATA5		(0xFFu<<8)
#define	CAN_TDH0R_DATA5_0	(0x1u<<8)
#define	CAN_TDH0R_DATA6		(0xFFu<<16)
#define	CAN_TDH0R_DATA6_0	(0x1u<<16)
#define	CAN_TDH0R_DATA7		(0xFFu<<24)
#define	CAN_TDH0R_DATA7_0	(0x1u<<24)

// TI1R Configuration

#define	CAN_TI1R_TXRQ		(0x1u<<0)
#define	CAN_TI1R_RTR		(0x1u<<1)
#define	CAN_TI1R_IDE		(0x1u<<2)
#define	CAN_TI1R_EXID		(0x3FFFFu<<3)
#define	CAN_TI1R_EXID_0		(0x1u<<3)
#define	CAN_TI1R_STID		(0x7FFu<<21)
#define	CAN_TI1R_STID_0		(0x1u<<21)

// TDT1R Configuration

#define	CAN_TDT1R_DLC		(0xFu<<0)
#define	CAN_TDT1R_DLC_0		(0x1u<<0)
#define	CAN_TDT1R_TGT		(0x1u<<8)
#define	CAN_TDT1R_TIME		(0xFFFFu<<16)
#define	CAN_TDT1R_TIME_0	(0x1u<<16)

// TDL1R Configuration

#define	CAN_TDL1R_DATA0		(0xFFu<<0)
#define	CAN_TDL1R_DATA0_0	(0x1u<<0)
#define	CAN_TDL1R_DATA1		(0xFFu<<8)
#define	CAN_TDL1R_DATA1_0	(0x1u<<8)
#define	CAN_TDL1R_DATA2		(0xFFu<<16)
#define	CAN_TDL1R_DATA2_0	(0x1u<<16)
#define	CAN_TDL1R_DATA3		(0xFFu<<24)
#define	CAN_TDL1R_DATA3_0	(0x1u<<24)

// TDH1R Configuration

#define	CAN_TDH1R_DATA4		(0xFFu<<0)
#define	CAN_TDH1R_DATA4_0	(0x1u<<0)
#define	CAN_TDH1R_DATA5		(0xFFu<<8)
#define	CAN_TDH1R_DATA5_0	(0x1u<<8)
#define	CAN_TDH1R_DATA6		(0xFFu<<16)
#define	CAN_TDH1R_DATA6_0	(0x1u<<16)
#define	CAN_TDH1R_DATA7		(0xFFu<<24)
#define	CAN_TDH1R_DATA7_0	(0x1u<<24)

// TI2R Configuration

#define	CAN_TI2R_TXRQ		(0x1u<<0)
#define	CAN_TI2R_RTR		(0x1u<<1)
#define	CAN_TI2R_IDE		(0x1u<<2)
#define	CAN_TI2R_EXID		(0x3FFFFu<<3)
#define	CAN_TI2R_EXID_0		(0x1u<<3)
#define	CAN_TI2R_STID		(0x7FFu<<21)
#define	CAN_TI2R_STID_0		(0x1u<<21)

// TDT2R Configuration

#define	CAN_TDT2R_DLC		(0xFu<<0)
#define	CAN_TDT2R_DLC_0		(0x1u<<0)
#define	CAN_TDT2R_TGT		(0x1u<<8)
#define	CAN_TDT2R_TIME		(0xFFFFu<<16)
#define	CAN_TDT2R_TIME_0	(0x1u<<16)

// TDL2R Configuration

#define	CAN_TDL2R_DATA0		(0xFFu<<0)
#define	CAN_TDL2R_DATA0_0	(0x1u<<0)
#define	CAN_TDL2R_DATA1		(0xFFu<<8)
#define	CAN_TDL2R_DATA1_0	(0x1u<<8)
#define	CAN_TDL2R_DATA2		(0xFFu<<16)
#define	CAN_TDL2R_DATA2_0	(0x1u<<16)
#define	CAN_TDL2R_DATA3		(0xFFu<<24)
#define	CAN_TDL2R_DATA3_0	(0x1u<<24)

// TDH2R Configuration

#define	CAN_TDH2R_DATA4		(0xFFu<<0)
#define	CAN_TDH2R_DATA4_0	(0x1u<<0)
#define	CAN_TDH2R_DATA5		(0xFFu<<8)
#define	CAN_TDH2R_DATA5_0	(0x1u<<8)
#define	CAN_TDH2R_DATA6		(0xFFu<<16)
#define	CAN_TDH2R_DATA6_0	(0x1u<<16)
#define	CAN_TDH2R_DATA7		(0xFFu<<24)
#define	CAN_TDH2R_DATA7_0	(0x1u<<24)

// RI0R Configuration

#define	CAN_RI0R_RTR		(0x1u<<1)
#define	CAN_RI0R_IDE		(0x1u<<2)
#define	CAN_RI0R_EXID		(0x3FFFFu<<3)
#define	CAN_RI0R_EXID_0		(0x1u<<3)
#define	CAN_RI0R_STID		(0x7FFu<<21)
#define	CAN_RI0R_STID_0		(0x1u<<21)

// RDT0R Configuration

#define	CAN_RDT0R_DLC		(0xFu<<0)
#define	CAN_RDT0R_DLC_0		(0x1u<<0)
#define	CAN_RDT0R_FMI		(0xFFu<<8)
#define	CAN_RDT0R_FMI_0		(0x1u<<8)
#define	CAN_RDT0R_TIME		(0xFFFFu<<16)
#define	CAN_RDT0R_TIME_0	(0x1u<<16)

// RDL0R Configuration

#define	CAN_RDL0R_DATA0		(0xFFu<<0)
#define	CAN_RDL0R_DATA0_0	(0x1u<<0)
#define	CAN_RDL0R_DATA1		(0xFFu<<8)
#define	CAN_RDL0R_DATA1_0	(0x1u<<8)
#define	CAN_RDL0R_DATA2		(0xFFu<<16)
#define	CAN_RDL0R_DATA2_0	(0x1u<<16)
#define	CAN_RDL0R_DATA3		(0xFFu<<24)
#define	CAN_RDL0R_DATA3_0	(0x1u<<24)

// RDH0R Configuration

#define	CAN_RDH0R_DATA4		(0xFFu<<0)
#define	CAN_RDH0R_DATA4_0	(0x1u<<0)
#define	CAN_RDH0R_DATA5		(0xFFu<<8)
#define	CAN_RDH0R_DATA5_0	(0x1u<<8)
#define	CAN_RDH0R_DATA6		(0xFFu<<16)
#define	CAN_RDH0R_DATA6_0	(0x1u<<16)
#define	CAN_RDH0R_DATA7		(0xFFu<<24)
#define	CAN_RDH0R_DATA7_0	(0x1u<<24)

// RI1R Configuration

#define	CAN_RI1R_RTR		(0x1u<<1)
#define	CAN_RI1R_IDE		(0x1u<<2)
#define	CAN_RI1R_EXID		(0x3FFFFu<<3)
#define	CAN_RI1R_EXID_0		(0x1u<<3)
#define	CAN_RI1R_STID		(0x7FFu<<21)
#define	CAN_RI1R_STID_0		(0x1u<<21)

