Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_can.h
#define	CAN_F0R2_FB31		(0x1u<<31)
#define	CAN_F0R2_FB30		(0x1u<<30)
#define	CAN_F0R2_FB29		(0x1u<<29)
#define	CAN_F0R2_FB28		(0x1u<<28)
#define	CAN_F0R2_FB27		(0x1u<<27)
#define	CAN_F0R2_FB26		(0x1u<<26)
#define	CAN_F0R2_FB25		(0x1u<<25)
#define	CAN_F0R2_FB24		(0x1u<<24)
#define	CAN_F0R2_FB23		(0x1u<<23)
#define	CAN_F0R2_FB22		(0x1u<<22)
#define	CAN_F0R2_FB21		(0x1u<<21)
#define	CAN_F0R2_FB20		(0x1u<<20)
#define	CAN_F0R2_FB19		(0x1u<<19)
#define	CAN_F0R2_FB18		(0x1u<<18)
#define	CAN_F0R2_FB17		(0x1u<<17)
#define	CAN_F0R2_FB16		(0x1u<<16)
#define	CAN_F0R2_FB15		(0x1u<<15)
#define	CAN_F0R2_FB14		(0x1u<<14)
#define	CAN_F0R2_FB13		(0x1u<<13)
#define	CAN_F0R2_FB12		(0x1u<<12)
#define	CAN_F0R2_FB11		(0x1u<<11)
#define	CAN_F0R2_FB10		(0x1u<<10)
#define	CAN_F0R2_FB9		(0x1u<<9)
#define	CAN_F0R2_FB8		(0x1u<<8)
#define	CAN_F0R2_FB7		(0x1u<<7)
#define	CAN_F0R2_FB6		(0x1u<<6)
#define	CAN_F0R2_FB5		(0x1u<<5)
#define	CAN_F0R2_FB4		(0x1u<<4)
#define	CAN_F0R2_FB3		(0x1u<<3)
#define	CAN_F0R2_FB2		(0x1u<<2)
#define	CAN_F0R2_FB1		(0x1u<<1)
#define	CAN_F0R2_FB0		(0x1u<<0)

// F1R1 Configuration

#define	CAN_F1R1_FB31		(0x1u<<31)
#define	CAN_F1R1_FB30		(0x1u<<30)
#define	CAN_F1R1_FB29		(0x1u<<29)
#define	CAN_F1R1_FB28		(0x1u<<28)
#define	CAN_F1R1_FB27		(0x1u<<27)
#define	CAN_F1R1_FB26		(0x1u<<26)
#define	CAN_F1R1_FB25		(0x1u<<25)
#define	CAN_F1R1_FB24		(0x1u<<24)
#define	CAN_F1R1_FB23		(0x1u<<23)
#define	CAN_F1R1_FB22		(0x1u<<22)
#define	CAN_F1R1_FB21		(0x1u<<21)
#define	CAN_F1R1_FB20		(0x1u<<20)
#define	CAN_F1R1_FB19		(0x1u<<19)
#define	CAN_F1R1_FB18		(0x1u<<18)
#define	CAN_F1R1_FB17		(0x1u<<17)
#define	CAN_F1R1_FB16		(0x1u<<16)
#define	CAN_F1R1_FB15		(0x1u<<15)
#define	CAN_F1R1_FB14		(0x1u<<14)
#define	CAN_F1R1_FB13		(0x1u<<13)
#define	CAN_F1R1_FB12		(0x1u<<12)
#define	CAN_F1R1_FB11		(0x1u<<11)
#define	CAN_F1R1_FB10		(0x1u<<10)
#define	CAN_F1R1_FB9		(0x1u<<9)
#define	CAN_F1R1_FB8		(0x1u<<8)
#define	CAN_F1R1_FB7		(0x1u<<7)
#define	CAN_F1R1_FB6		(0x1u<<6)
#define	CAN_F1R1_FB5		(0x1u<<5)
#define	CAN_F1R1_FB4		(0x1u<<4)
#define	CAN_F1R1_FB3		(0x1u<<3)
#define	CAN_F1R1_FB2		(0x1u<<2)
#define	CAN_F1R1_FB1		(0x1u<<1)
#define	CAN_F1R1_FB0		(0x1u<<0)

// F1R2 Configuration

#define	CAN_F1R2_FB31		(0x1u<<31)
#define	CAN_F1R2_FB30		(0x1u<<30)
#define	CAN_F1R2_FB29		(0x1u<<29)
#define	CAN_F1R2_FB28		(0x1u<<28)
#define	CAN_F1R2_FB27		(0x1u<<27)
#define	CAN_F1R2_FB26		(0x1u<<26)
#define	CAN_F1R2_FB25		(0x1u<<25)
#define	CAN_F1R2_FB24		(0x1u<<24)
#define	CAN_F1R2_FB23		(0x1u<<23)
#define	CAN_F1R2_FB22		(0x1u<<22)
#define	CAN_F1R2_FB21		(0x1u<<21)
#define	CAN_F1R2_FB20		(0x1u<<20)
#define	CAN_F1R2_FB19		(0x1u<<19)
#define	CAN_F1R2_FB18		(0x1u<<18)
#define	CAN_F1R2_FB17		(0x1u<<17)
#define	CAN_F1R2_FB16		(0x1u<<16)
#define	CAN_F1R2_FB15		(0x1u<<15)
#define	CAN_F1R2_FB14		(0x1u<<14)
#define	CAN_F1R2_FB13		(0x1u<<13)
#define	CAN_F1R2_FB12		(0x1u<<12)
#define	CAN_F1R2_FB11		(0x1u<<11)
#define	CAN_F1R2_FB10		(0x1u<<10)
#define	CAN_F1R2_FB9		(0x1u<<9)
#define	CAN_F1R2_FB8		(0x1u<<8)
#define	CAN_F1R2_FB7		(0x1u<<7)
#define	CAN_F1R2_FB6		(0x1u<<6)
#define	CAN_F1R2_FB5		(0x1u<<5)
#define	CAN_F1R2_FB4		(0x1u<<4)
#define	CAN_F1R2_FB3		(0x1u<<3)
#define	CAN_F1R2_FB2		(0x1u<<2)
#define	CAN_F1R2_FB1		(0x1u<<1)
#define	CAN_F1R2_FB0		(0x1u<<0)

// F2R1 Configuration

#define	CAN_F2R1_FB31		(0x1u<<31)
#define	CAN_F2R1_FB30		(0x1u<<30)
#define	CAN_F2R1_FB29		(0x1u<<29)
#define	CAN_F2R1_FB28		(0x1u<<28)
#define	CAN_F2R1_FB27		(0x1u<<27)
#define	CAN_F2R1_FB26		(0x1u<<26)
#define	CAN_F2R1_FB25		(0x1u<<25)
#define	CAN_F2R1_FB24		(0x1u<<24)
#define	CAN_F2R1_FB23		(0x1u<<23)
#define	CAN_F2R1_FB22		(0x1u<<22)
#define	CAN_F2R1_FB21		(0x1u<<21)
#define	CAN_F2R1_FB20		(0x1u<<20)
#define	CAN_F2R1_FB19		(0x1u<<19)
#define	CAN_F2R1_FB18		(0x1u<<18)
#define	CAN_F2R1_FB17		(0x1u<<17)
#define	CAN_F2R1_FB16		(0x1u<<16)
#define	CAN_F2R1_FB15		(0x1u<<15)
#define	CAN_F2R1_FB14		(0x1u<<14)
#define	CAN_F2R1_FB13		(0x1u<<13)
#define	CAN_F2R1_FB12		(0x1u<<12)
#define	CAN_F2R1_FB11		(0x1u<<11)
#define	CAN_F2R1_FB10		(0x1u<<10)
#define	CAN_F2R1_FB9		(0x1u<<9)
#define	CAN_F2R1_FB8		(0x1u<<8)
#define	CAN_F2R1_FB7		(0x1u<<7)
#define	CAN_F2R1_FB6		(0x1u<<6)
#define	CAN_F2R1_FB5		(0x1u<<5)
#define	CAN_F2R1_FB4		(0x1u<<4)
#define	CAN_F2R1_FB3		(0x1u<<3)
#define	CAN_F2R1_FB2		(0x1u<<2)
#define	CAN_F2R1_FB1		(0x1u<<1)
#define	CAN_F2R1_FB0		(0x1u<<0)

// F2R2 Configuration

#define	CAN_F2R2_FB31		(0x1u<<31)
#define	CAN_F2R2_FB30		(0x1u<<30)
#define	CAN_F2R2_FB29		(0x1u<<29)
#define	CAN_F2R2_FB28		(0x1u<<28)
#define	CAN_F2R2_FB27		(0x1u<<27)
#define	CAN_F2R2_FB26		(0x1u<<26)
#define	CAN_F2R2_FB25		(0x1u<<25)
#define	CAN_F2R2_FB24		(0x1u<<24)
#define	CAN_F2R2_FB23		(0x1u<<23)
#define	CAN_F2R2_FB22		(0x1u<<22)
#define	CAN_F2R2_FB21		(0x1u<<21)
#define	CAN_F2R2_FB20		(0x1u<<20)
#define	CAN_F2R2_FB19		(0x1u<<19)
#define	CAN_F2R2_FB18		(0x1u<<18)
#define	CAN_F2R2_FB17		(0x1u<<17)
#define	CAN_F2R2_FB16		(0x1u<<16)
#define	CAN_F2R2_FB15		(0x1u<<15)
#define	CAN_F2R2_FB14		(0x1u<<14)
#define	CAN_F2R2_FB13		(0x1u<<13)
#define	CAN_F2R2_FB12		(0x1u<<12)
#define	CAN_F2R2_FB11		(0x1u<<11)
#define	CAN_F2R2_FB10		(0x1u<<10)
#define	CAN_F2R2_FB9		(0x1u<<9)
#define	CAN_F2R2_FB8		(0x1u<<8)
#define	CAN_F2R2_FB7		(0x1u<<7)
#define	CAN_F2R2_FB6		(0x1u<<6)
#define	CAN_F2R2_FB5		(0x1u<<5)
#define	CAN_F2R2_FB4		(0x1u<<4)
#define	CAN_F2R2_FB3		(0x1u<<3)
#define	CAN_F2R2_FB2		(0x1u<<2)
#define	CAN_F2R2_FB1		(0x1u<<1)
#define	CAN_F2R2_FB0		(0x1u<<0)

// F3R1 Configuration

#define	CAN_F3R1_FB31		(0x1u<<31)
#define	CAN_F3R1_FB30		(0x1u<<30)
#define	CAN_F3R1_FB29		(0x1u<<29)
#define	CAN_F3R1_FB28		(0x1u<<28)
#define	CAN_F3R1_FB27		(0x1u<<27)
#define	CAN_F3R1_FB26		(0x1u<<26)
#define	CAN_F3R1_FB25		(0x1u<<25)
#define	CAN_F3R1_FB24		(0x1u<<24)
#define	CAN_F3R1_FB23		(0x1u<<23)
#define	CAN_F3R1_FB22		(0x1u<<22)
#define	CAN_F3R1_FB21		(0x1u<<21)
#define	CAN_F3R1_FB20		(0x1u<<20)
#define	CAN_F3R1_FB19		(0x1u<<19)
#define	CAN_F3R1_FB18		(0x1u<<18)
#define	CAN_F3R1_FB17		(0x1u<<17)
#define	CAN_F3R1_FB16		(0x1u<<16)
#define	CAN_F3R1_FB15		(0x1u<<15)
#define	CAN_F3R1_FB14		(0x1u<<14)
#define	CAN_F3R1_FB13		(0x1u<<13)
#define	CAN_F3R1_FB12		(0x1u<<12)
#define	CAN_F3R1_FB11		(0x1u<<11)
#define	CAN_F3R1_FB10		(0x1u<<10)
#define	CAN_F3R1_FB9		(0x1u<<9)
#define	CAN_F3R1_FB8		(0x1u<<8)
#define	CAN_F3R1_FB7		(0x1u<<7)
#define	CAN_F3R1_FB6		(0x1u<<6)
#define	CAN_F3R1_FB5		(0x1u<<5)
#define	CAN_F3R1_FB4		(0x1u<<4)
#define	CAN_F3R1_FB3		(0x1u<<3)
#define	CAN_F3R1_FB2		(0x1u<<2)
#define	CAN_F3R1_FB1		(0x1u<<1)
#define	CAN_F3R1_FB0		(0x1u<<0)

// F3R2 Configuration

#define	CAN_F3R2_FB31		(0x1u<<31)
#define	CAN_F3R2_FB30		(0x1u<<30)
#define	CAN_F3R2_FB29		(0x1u<<29)
#define	CAN_F3R2_FB28		(0x1u<<28)
#define	CAN_F3R2_FB27		(0x1u<<27)
#define	CAN_F3R2_FB26		(0x1u<<26)
#define	CAN_F3R2_FB25		(0x1u<<25)
#define	CAN_F3R2_FB24		(0x1u<<24)
#define	CAN_F3R2_FB23		(0x1u<<23)
#define	CAN_F3R2_FB22		(0x1u<<22)
#define	CAN_F3R2_FB21		(0x1u<<21)
#define	CAN_F3R2_FB20		(0x1u<<20)
#define	CAN_F3R2_FB19		(0x1u<<19)
#define	CAN_F3R2_FB18		(0x1u<<18)
#define	CAN_F3R2_FB17		(0x1u<<17)
#define	CAN_F3R2_FB16		(0x1u<<16)
#define	CAN_F3R2_FB15		(0x1u<<15)
#define	CAN_F3R2_FB14		(0x1u<<14)
#define	CAN_F3R2_FB13		(0x1u<<13)
#define	CAN_F3R2_FB12		(0x1u<<12)
#define	CAN_F3R2_FB11		(0x1u<<11)
#define	CAN_F3R2_FB10		(0x1u<<10)
#define	CAN_F3R2_FB9		(0x1u<<9)
#define	CAN_F3R2_FB8		(0x1u<<8)
#define	CAN_F3R2_FB7		(0x1u<<7)
#define	CAN_F3R2_FB6		(0x1u<<6)
#define	CAN_F3R2_FB5		(0x1u<<5)
#define	CAN_F3R2_FB4		(0x1u<<4)
#define	CAN_F3R2_FB3		(0x1u<<3)
#define	CAN_F3R2_FB2		(0x1u<<2)
#define	CAN_F3R2_FB1		(0x1u<<1)
#define	CAN_F3R2_FB0		(0x1u<<0)

